
## :white_check_mark: Apply Result

[CI link](https://github.com/mizzy/sakura-cloud-education-touch-demo/actions/runs/1519819130)

<pre><code>Apply complete! Resources: 4 added, 1 changed, 3 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
aws_vpc.ecs_sample: Refreshing state... [id=vpc-05fa6437d1950b505]
aws_cloudwatch_log_group.for_ecs: Refreshing state... [id=/ecs/sample]
aws_ecs_cluster.sample: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:722557045766:cluster/sample]
aws_s3_bucket.alb_log: Refreshing state... [id=alb-log-of-ecs-sample]
module.ecs_task_execution_role.aws_iam_role.default: Refreshing state... [id=ecs-task-execution]
module.ecs_task_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::722557045766:policy/ecs-task]
module.ecs_task_role.aws_iam_role.default: Refreshing state... [id=ecs-task]
module.ecs_task_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-20211128085513439500000001]
aws_ecs_task_definition.sample: Refreshing state... [id=sample]
module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::722557045766:policy/ecs-task-execution]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20211128085513532900000002]
aws_subnet.private1: Refreshing state... [id=subnet-0b80416f81081f9d5]
aws_route_table.public: Refreshing state... [id=rtb-02b3748a419fb2683]
module.https_redirect_sg.aws_security_group.default: Refreshing state... [id=sg-0811d352871ab950e]
module.nginx_sg.aws_security_group.default: Refreshing state... [id=sg-0111abdb1dcf35f4c]
aws_internet_gateway.igw: Refreshing state... [id=igw-0e1685b83df866267]
aws_route_table.private1: Refreshing state... [id=rtb-0eed5c91cda4b3acc]
aws_subnet.public1: Refreshing state... [id=subnet-0e4d908c8b6012cf4]
aws_route_table.private0: Refreshing state... [id=rtb-04c52d0c2f4f6fb3e]
aws_subnet.private0: Refreshing state... [id=subnet-0360de0228650800c]
module.https_sg.aws_security_group.default: Refreshing state... [id=sg-0d03c39c130171a25]
module.http_sg.aws_security_group.default: Refreshing state... [id=sg-0be58c4f1a48c6129]
aws_subnet.public0: Refreshing state... [id=subnet-02d54a30d5f61210a]
aws_eip.ngw1: Refreshing state... [id=eipalloc-0db2eac64498abb7a]
module.https_redirect_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-2663386237]
aws_eip.ngw0: Refreshing state... [id=eipalloc-04e367929021a68b1]
module.https_redirect_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1723817718]
aws_route_table_association.private0: Refreshing state... [id=rtbassoc-0104951db21990e4a]
aws_route.public: Refreshing state... [id=r-rtb-02b3748a419fb26831080289494]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-03c410620e7b366e5]
module.nginx_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1081637939]
module.nginx_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-298557167]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0b0139d2ccca64f23]
module.http_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1740198367]
module.http_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-4215454654]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-701884444]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-1132770594]
aws_route_table_association.public0: Refreshing state... [id=rtbassoc-00ef7c2460170cd58]
aws_nat_gateway.ngw0: Refreshing state... [id=nat-07c363cea9ebe7c20]
aws_nat_gateway.ngw1: Refreshing state... [id=nat-0a57b2a380445c52a]
aws_route.private0: Refreshing state... [id=r-rtb-04c52d0c2f4f6fb3e1080289494]
aws_route.private1: Refreshing state... [id=r-rtb-0eed5c91cda4b3acc1080289494]
aws_lb.sample: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:loadbalancer/app/sample/2aef9e53f7888967]
aws_s3_bucket_policy.alb_log: Refreshing state... [id=alb-log-of-ecs-sample]
aws_lb_target_group.sample: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:targetgroup/sample/2ac5a7a4fd71cf94]
aws_route53_record.sample: Refreshing state... [id=Z07054061YZ4SIOQH4B64_sakura-cloud-education-touch-demo.com_A]
aws_acm_certificate.sample: Refreshing state... [id=arn:aws:acm:ap-northeast-1:722557045766:certificate/de0400cf-7674-41d6-b992-1024d6b496a8]
aws_ecs_service.sample: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:722557045766:service/sample/sample]
aws_route53_record.sample_cert_validation: Refreshing state... [id=Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com._CNAME]
aws_acm_certificate_validation.sample: Refreshing state... [id=2021-11-28 09:35:44 +0000 UTC]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener/app/sample/2aef9e53f7888967/64f5cb61d316f892]
aws_lb_listener_rule.sample: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener-rule/app/sample/2aef9e53f7888967/64f5cb61d316f892/176d6d7af801e373]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_route53_record.sample_cert_validation has been changed
  ~ resource "aws_route53_record" "sample_cert_validation" {
        id      = "Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com._CNAME"
        name    = "_67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com"
        # (5 unchanged attributes hidden)
    }
  # aws_acm_certificate.sample has been changed
  ~ resource "aws_acm_certificate" "sample" {
        id                        = "arn:aws:acm:ap-northeast-1:722557045766:certificate/de0400cf-7674-41d6-b992-1024d6b496a8"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
      + tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.sample must be replaced
+/- resource "aws_acm_certificate" "sample" {
      ~ arn                       = "arn:aws:acm:ap-northeast-1:722557045766:certificate/de0400cf-7674-41d6-b992-1024d6b496a8" -> (known after apply)
      ~ domain_validation_options = [
          - {
              - domain_name           = "sakura-cloud-education-touch-demo.com"
              - resource_record_name  = "_67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6f697d1307da8bc63b9c52776389643e.kzhndfqvzk.acm-validations.aws."
            },
            # (2 unchanged elements hidden)
        ]
      ~ id                        = "arn:aws:acm:ap-northeast-1:722557045766:certificate/de0400cf-7674-41d6-b992-1024d6b496a8" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "*.sakura-cloud-education-touch-demo.com",
        ]
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.sample must be replaced
-/+ resource "aws_acm_certificate_validation" "sample" {
      ~ certificate_arn         = "arn:aws:acm:ap-northeast-1:722557045766:certificate/de0400cf-7674-41d6-b992-1024d6b496a8" -> (known after apply) # forces replacement
      ~ id                      = "2021-11-28 09:35:44 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com",
        ] -> (known after apply) # forces replacement
    }

  # aws_lb_listener.https will be updated in-place
  ~ resource "aws_lb_listener" "https" {
      ~ certificate_arn   = "arn:aws:acm:ap-northeast-1:722557045766:certificate/de0400cf-7674-41d6-b992-1024d6b496a8" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener/app/sample/2aef9e53f7888967/64f5cb61d316f892"
        tags              = {}
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.nginx will be created
  + resource "aws_route53_record" "nginx" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "nginx.sakura-cloud-education-touch-demo.com"
      + type            = "A"
      + zone_id         = "Z07054061YZ4SIOQH4B64"

      + alias {
          + evaluate_target_health = true
          + name                   = "sample-1357241970.ap-northeast-1.elb.amazonaws.com"
          + zone_id                = "Z14GRHDCWA56QT"
        }
    }

  # aws_route53_record.sample_cert_validation must be replaced
-/+ resource "aws_route53_record" "sample_cert_validation" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com" -> (known after apply)
      ~ id              = "Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com._CNAME" -> (known after apply)
      ~ name            = "_67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com" -> (known after apply) # forces replacement
      ~ records         = [
          - "_6f697d1307da8bc63b9c52776389643e.kzhndfqvzk.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 3 to destroy.
aws_acm_certificate_validation.sample: Destroying... [id=2021-11-28 09:35:44 +0000 UTC]
aws_acm_certificate_validation.sample: Destruction complete after 0s
aws_route53_record.sample_cert_validation: Destroying... [id=Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com._CNAME]
aws_route53_record.nginx: Creating...
aws_route53_record.sample_cert_validation: Still destroying... [id=Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a...-cloud-education-touch-demo.com._CNAME, 10s elapsed]
aws_route53_record.nginx: Still creating... [10s elapsed]
aws_route53_record.sample_cert_validation: Still destroying... [id=Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a...-cloud-education-touch-demo.com._CNAME, 20s elapsed]
aws_route53_record.nginx: Still creating... [20s elapsed]
aws_route53_record.sample_cert_validation: Still destroying... [id=Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a...-cloud-education-touch-demo.com._CNAME, 30s elapsed]
aws_route53_record.nginx: Still creating... [30s elapsed]
aws_route53_record.sample_cert_validation: Destruction complete after 36s
aws_acm_certificate.sample: Creating...
aws_route53_record.nginx: Creation complete after 37s [id=Z07054061YZ4SIOQH4B64_nginx.sakura-cloud-education-touch-demo.com_A]
aws_acm_certificate.sample: Still creating... [10s elapsed]
aws_acm_certificate.sample: Still creating... [20s elapsed]
aws_acm_certificate.sample: Creation complete after 22s [id=arn:aws:acm:ap-northeast-1:722557045766:certificate/7c143eee-a900-4667-a0c2-971d4d8708b8]
aws_route53_record.sample_cert_validation: Creating...
aws_route53_record.sample_cert_validation: Still creating... [10s elapsed]
aws_route53_record.sample_cert_validation: Still creating... [20s elapsed]
aws_route53_record.sample_cert_validation: Still creating... [30s elapsed]
aws_route53_record.sample_cert_validation: Creation complete after 37s [id=Z07054061YZ4SIOQH4B64__67eb6117e9f97e2a75b4417b0fa42f19.sakura-cloud-education-touch-demo.com._CNAME]
aws_acm_certificate_validation.sample: Creating...
aws_acm_certificate_validation.sample: Creation complete after 2s [id=2021-11-30 08:10:07 +0000 UTC]
aws_lb_listener.https: Modifying... [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener/app/sample/2aef9e53f7888967/64f5cb61d316f892]
aws_lb_listener.https: Modifications complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:722557045766:listener/app/sample/2aef9e53f7888967/64f5cb61d316f892]
aws_acm_certificate.sample (deposed object 62bbcb75): Destroying... [id=arn:aws:acm:ap-northeast-1:722557045766:certificate/de0400cf-7674-41d6-b992-1024d6b496a8]
aws_acm_certificate.sample: Still destroying... [id=arn:aws:acm:ap-northeast-1:722557045766...e/de0400cf-7674-41d6-b992-1024d6b496a8, 10s elapsed]
aws_acm_certificate.sample: Destruction complete after 19s

Apply complete! Resources: 4 added, 1 changed, 3 destroyed.

Outputs:

alb_dns_name = "sample-1357241970.ap-northeast-1.elb.amazonaws.com"
domain_name = "sakura-cloud-education-touch-demo.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":6,"Program":"tfcmt","SHA1":"a0a5b59911f8d04583ad3362df2a89b4550a943d","Vars":{},"WorkflowName":"terraform"} -->